<?php
/**
 * Скрипт инициализации приложения-примера.
 * Чтоб не корежить index.php, который в некотором роде - часть движка, пишем тут всякое конкретно по приложению.
 * Этот скрипт - сборник костылей, которые не нашли себе места в строгом стандарте движка.
 */

/**
 * Упростил себе жизнь. Заколебался писать FQN-путь к методу. Не по "фен-шую" конечно, но для приложения покатит.
 * Теперь вызов простой: dd($var1, $var2, ...);
 */
function dd() {
    foreach (func_get_args() as $var) {
        echo engine\utils\Dumper::dump($var);
    }
}
