<?php
/**
 * Роуты приложения
 * Идея описания маршрутов взята в Yii 1.x. Реализация своя.
 *
 * Левая часть, маска параметров: <[a-z0-9_]+:.+>, не зависит от регистра. Так же можно указывать спец.символы без
 * параметризации. Тогда они будут просто восприняты, как часть регулярки.
 *
 * Простые ошибки:
 * - 404 = обратный слеш вместо прямого. Нужно использовать '/'
 * - 404 = справа несоблюдение регистра, например контроллер с маленькой буквы, а на деле - с большой.
 */
return [
    //модуль юзера
    APP_NS_PREFIX . 'modules\user\controllers\\' => [
        'registration' => 'Registration',
        //@TODO остальные actions контроллера прописать

        'login'   => 'Login',
        'logout'  => 'Login/out',
        'recover' => 'Login/recover',
        'profile' => 'Profile',
    ],

    //модуль админки
    APP_NS_PREFIX . 'modules\admin\\' => [
    ],

    //Основная зона контроллеров
    APP_NS_PREFIX . 'controllers\\'       => [
        //Общие правила. Должны быть самыми последними вообще
        '<controller:[a-z]+>' => '<controller>',
        '<controller:[a-z]+>/<action:[a-z]+>' => '<controller>/<action>',
    ]
];
